BVO93/TI_CC2640R2_GetttingStarted/swi_CC2640R2_LAUNCHXL_tirtos_gcc/Debug/configPkg/package/cfg/swi_pm3g.c
/*
 * ======== ti.sysbios.family.arm.cc26xx.Boot TEMPLATE ========
 */


#include <ti/devices/DeviceFamily.h>

#include DeviceFamily_constructPath(inc/hw_types.h)



/* workaround bug in driverlib */

/*
 * ======== ti.sysbios.rom.ROM TEMPLATE ========
 */


/*
 *  functions explicitly excluded from the ROM
 */
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_start__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_start__E")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_start__E = (xdc_Void *)ti_sysbios_family_arm_cc26xx_Timer_start__E;

xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_initDevice__I __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_initDevice__I")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_initDevice__I = (xdc_Void *)ti_sysbios_family_arm_cc26xx_Timer_initDevice__I;

xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I = (xdc_Void *)ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I;

xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E = (xdc_Void *)ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E;

xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E = (xdc_Void *)ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E;

xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_getCount64__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_getCount64__E")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_getCount64__E = (xdc_Void *)ti_sysbios_family_arm_cc26xx_Timer_getCount64__E;

xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E = (xdc_Void *)ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E;

xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E = (xdc_Void *)ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E;

xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E = (xdc_Void *)ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E;

xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_knl_Clock_workFuncDynamic__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_knl_Clock_workFuncDynamic__E")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_knl_Clock_workFuncDynamic__E = (xdc_Void *)ti_sysbios_knl_Clock_workFuncDynamic__E;

/*
 *  generated functions referenced from within the ROM
 */
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_Startup_getState__I __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_Startup_getState__I")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_Startup_getState__I = (xdc_Void *)xdc_runtime_Startup_getState__I;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_Module__startupDone__S __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_Module__startupDone__S")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_Module__startupDone__S = (xdc_Void *)xdc_runtime_System_SupportProxy_Module__startupDone__S;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_abort__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_abort__E")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_abort__E = (xdc_Void *)xdc_runtime_System_SupportProxy_abort__E;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_exit__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_exit__E")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_exit__E = (xdc_Void *)xdc_runtime_System_SupportProxy_exit__E;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_flush__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_flush__E")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_flush__E = (xdc_Void *)xdc_runtime_System_SupportProxy_flush__E;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_putch__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_putch__E")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_putch__E = (xdc_Void *)xdc_runtime_System_SupportProxy_putch__E;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_ready__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_ready__E")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_ready__E = (xdc_Void *)xdc_runtime_System_SupportProxy_ready__E;



/*
 * ======== ti.sysbios.rom.cortexm.cc26xx.r2.CC26xx TEMPLATE ========
 */




extern unsigned int __sysbios_rom_data_load__;
extern unsigned int __sysbios_rom_data_start__;
extern unsigned int __sysbios_rom_data_end__;

extern unsigned int __sysbios_data_other_load__;
extern unsigned int __sysbios_data_other_start__;
extern unsigned int __sysbios_data_other_end__;

void ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_dataInit()
{
    unsigned int * dl;
    unsigned int * ds;
    unsigned int * de;

    dl = & __sysbios_rom_data_load__;
    ds = & __sysbios_rom_data_start__;
    de = & __sysbios_rom_data_end__;

    while (ds < de) {
        *ds = *dl;
        dl++;
        ds++;
    }

