BVO93/TI_CC2640R2_GetttingStarted/swi_CC2640R2_LAUNCHXL_tirtos_gcc/Debug/configPkg/package/cfg/swi_pm3g.c
/* Module__gatePrms__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gatePrms ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gatePrms__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gatePrms__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gatePrms ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gatePrms__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__gatePrms)NULL);

/* Module__id__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__id ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__id__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__id__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__id ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__id__C = (xdc_Bits16)0x2f;

/* Module__loggerDefined__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerDefined__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerDefined__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerObj ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerObj__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerObj__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerObj ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerObj__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerObj)NULL);

/* Module__loggerFxn0__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn0__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn0__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn0__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn0)NULL);

/* Module__loggerFxn1__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn1__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn1__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn1__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn1)NULL);

/* Module__loggerFxn2__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn2__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn2__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn2__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn2)NULL);

/* Module__loggerFxn4__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn4__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn4__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn4__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn4)NULL);

/* Module__loggerFxn8__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn8 ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn8__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn8__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn8 ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn8__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Module__loggerFxn8)NULL);

/* Object__count__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__count ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__count__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__count__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__count ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__count__C = 0;

/* Object__heap__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__heap ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__heap__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__heap__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__heap ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__heap__C = NULL;

/* Object__sizeof__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__sizeof ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__sizeof__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__sizeof__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__sizeof ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__sizeof__C = 0;

/* Object__table__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__table ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__table__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__table__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__table ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_Object__table__C = NULL;

/* REVISION__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_REVISION ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_REVISION__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_REVISION__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_REVISION ti_sysbios_rom_cortexm_cc26xx_r2_CC26xx_REVISION__C = (xdc_UInt32)0x796e7242;


